shinymetal6/A_os/drivers/USB_Device/STM32H743/Target/usbd_conf.h
/* 
 * This program is free software: you can redistribute it and/or modify  
 * it under the terms of the GNU General Public License as published by  
 * the Free Software Foundation, version 3.
 *
 * This program is distributed in the hope that it will be useful, but 
 * WITHOUT ANY WARRANTY; without even the implied warranty of 
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU 
 * General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License 
 * along with this program. If not, see <http://www.gnu.org/licenses/>.
 *
 * Project : A_os
*/
/*
 * usbd_conf.h
 *
 *  Created on: Jan 24, 2024
 *      Author: fil
 */

#ifndef DRIVERS_USB_STM32H743_TARGET_USBD_CONF_H_
#define DRIVERS_USB_STM32H743_TARGET_USBD_CONF_H_

#ifdef	STM32H743xx

#ifdef	USB_DEVICE_ENABLED
#ifdef __cplusplus
 extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include "main.h"
#include "stm32h7xx.h"
#include "stm32h7xx_hal.h"

/*---------- -----------*/
#define USBD_MAX_NUM_INTERFACES     1U
/*---------- -----------*/
#define USBD_MAX_NUM_CONFIGURATION     1U
/*---------- -----------*/
#define USBD_MAX_STR_DESC_SIZ     512U
/*---------- -----------*/
#define USBD_DEBUG_LEVEL     0U
/*---------- -----------*/
#define USBD_LPM_ENABLED     1U
/*---------- -----------*/
#define USBD_SELF_POWERED     1U

#define DEVICE_FS 		0
#define DEVICE_HS 		1

/* VIDEO Class Config */
#define UVC_1_1

/* bEndpointAddress in Endpoint Descriptor */
#define UVC_IN_EP                                   0x81U

#define UVC_FPS_FS_MJPEG_VGA                        15U
#define UVC_FPS_FS_MJPEG_QVGA                       30U
#define UVC_FPS_FS_YUY2_VGA                         1U
#define UVC_FPS_FS_YUY2_QVGA                        6U

#define UVC_FPS_HS_MJPEG_VGA                        15U
#define UVC_FPS_HS_MJPEG_QVGA                       30U
#define UVC_FPS_HS_YUY2_VGA                         12U
#define UVC_FPS_HS_YUY2_QVGA                        30U

#define UVC_ISO_FS_MPS                              1023U
#define UVC_ISO_HS_MPS                              1024U
#define UVC_PACKET_SIZE                             1024U
#define UVC_MAX_FRAME_SIZE_VGA                      (640U * 480U * 16U / 8U)
#define UVC_MAX_FRAME_SIZE_QVGA                     (320U * 240U * 16U / 8U)
/* VIDEO Class Config END*/



#define USBD_malloc         (void *)USBD_static_malloc

/** Alias for memory release. */
#define USBD_free           USBD_static_free

/** Alias for memory set. */
#define USBD_memset         memset

/** Alias for memory copy. */
#define USBD_memcpy         memcpy

/** Alias for delay. */
#define USBD_Delay          HAL_Delay

/* DEBUG macros */

#if (USBD_DEBUG_LEVEL > 0)
#define USBD_UsrLog(...)    printf(__VA_ARGS__);\
                            printf("\n");
#else
#define USBD_UsrLog(...)
#endif /* (USBD_DEBUG_LEVEL > 0U) */

#if (USBD_DEBUG_LEVEL > 1)

#define USBD_ErrLog(...)    printf("ERROR: ");\
                            printf(__VA_ARGS__);\
                            printf("\n");
#else
#define USBD_ErrLog(...)
#endif /* (USBD_DEBUG_LEVEL > 1U) */

#if (USBD_DEBUG_LEVEL > 2)
#define USBD_DbgLog(...)    printf("DEBUG : ");\
                            printf(__VA_ARGS__);\
                            printf("\n");
#else
#define USBD_DbgLog(...)
#endif /* (USBD_DEBUG_LEVEL > 2U) */

void *USBD_static_malloc(uint32_t size);
void USBD_static_free(void *p);

#ifdef __cplusplus
}
#endif

#endif // #ifdef	USB_DEVICE_ENABLED

#endif // #ifdef	STM32H743xx

#endif /* DRIVERS_USB_STM32H743_TARGET_USBD_CONF_H_ */
